app/Models/Juri/HasilLombaModel.php

SELECT `hasillomba`.*, `pendaftaran`.`nama_team`, `cabang_perlombaan`.`nama_perlombaan`
FROM `hasillomba`
JOIN `pendaftaran` ON `hasillomba`.`pendaftaran_id` = `pendaftaran`.`id`
JOIN `cabang_perlombaan` ON `hasillomba`.`cabang_perlombaan_id` = `cabang_perlombaan`.`id`
---
    public function Hasillombabypendaftaran($cabangPerlombaanId = null)
    {
        $builder = $this->select('hasillomba.*, pendaftaran.nama_team, cabang_perlombaan.nama_perlombaan')
            ->join('pendaftaran', 'hasillomba.pendaftaran_id = pendaftaran.id')
            ->join('cabang_perlombaan', 'hasillomba.cabang_perlombaan_id = cabang_perlombaan.id');

        if ($cabangPerlombaanId) {
            $builder->where('hasillomba.cabang_perlombaan_id', $cabangPerlombaanId);
        }

        return $builder->get()->getResultArray();