app/Models/Admin/JuriModel.php

SELECT `juri`.*, `pt`.`nama_pt`, `cabang_perlombaan`.`nama_perlombaan`
FROM `juri`
JOIN `pt` ON `juri`.`pt_id` = `pt`.`id`
JOIN `cabang_perlombaan` ON `juri`.`cabang_perlombaan_id` = `cabang_perlombaan`.`id`
---
    public function JuribyPt()
    {
        return $this->select('juri.*,  pt.nama_pt, cabang_perlombaan.nama_perlombaan')
            ->join('pt', 'juri.pt_id = pt.id')
            ->join('cabang_perlombaan', 'juri.cabang_perlombaan_id = cabang_perlombaan.id')
            ->get()
            ->getResultArray();