app/Models/Admin/SertifikatModel.php

SELECT `sertifikat`.*, `peserta`.`nama_peserta`, `pt`.`nama_pt`, `prodi`.`nama_prodi`, `cabang_perlombaan`.`nama_perlombaan`
FROM `sertifikat`
JOIN `pt` ON `sertifikat`.`pt_id` = `pt`.`id`
JOIN `cabang_perlombaan` ON `sertifikat`.`cabang_perlombaan_id` = `cabang_perlombaan`.`id`
JOIN `peserta` ON `sertifikat`.`peserta_id` = `peserta`.`id`
JOIN `prodi` ON `sertifikat`.`prodi_id` = `prodi`.`id`
---
    public function sertifikat()
    {
        return $this->select('sertifikat.*, peserta.nama_peserta,  pt.nama_pt, cabang_perlombaan.nama_perlombaan')
            ->join('pt', 'sertifikat.pt_id = pt.id')
            ->join('cabang_perlombaan', 'sertifikat.cabang_perlombaan_id = cabang_perlombaan.id')
            ->join('peserta', 'sertifikat.peserta_id = peserta.id')

            ->get()
            ->getResultArray();