app/Models/Pendamping/PendaftaranModel.php

SELECT *
FROM `pendaftaran`
---
    public function getAllPendaftaran()
    {
        return $this->findAll();

SELECT `pendaftaran`.*, `peserta`.`nama_peserta`, `pt`.`nama_pt`, `cabang_perlombaan`.`nama_perlombaan`
FROM `pendaftaran`
JOIN `pt` ON `pendaftaran`.`pt_id` = `pt`.`id`
JOIN `cabang_perlombaan` ON `pendaftaran`.`cabang_perlombaan_id` = `cabang_perlombaan`.`id`
JOIN `peserta` ON `pendaftaran`.`peserta_id` = `peserta`.`id`
---
    public function PendaftaranbyPeserta()
    {
        return $this->select('pendaftaran.*, peserta.nama_peserta,  pt.nama_pt, cabang_perlombaan.nama_perlombaan')
            ->join('pt', 'pendaftaran.pt_id = pt.id')
            ->join('cabang_perlombaan', 'pendaftaran.cabang_perlombaan_id = cabang_perlombaan.id')
            ->join('peserta', 'pendaftaran.peserta_id = peserta.id')
            ->get()
            ->getResultArray();