app/Models/Pendamping/PendampingModel.php

    public function pendampingbyPt()
    {
        return $this->select('pendamping.*,  pt.nama_pt')
            ->join('pt', 'pendamping.pt_id = pt.id')
            ->get()
            ->getResultArray();
---
SELECT `pendamping`.*, `pt`.`nama_pt`
FROM `pendamping`
JOIN `pt` ON `pendamping`.`pt_id` = `pt`.`id`