app/Models/Pendamping/PesertaModel.php

SELECT *
FROM `peserta`
---
    public function getAllpeserta()
    {
        return $this->findAll();

SELECT `peserta`.*, `prodi`.`nama_prodi`, `pt`.`nama_pt`
FROM `peserta`
LEFT JOIN `prodi` ON `peserta`.`prodi_id` = `prodi`.`id`
LEFT JOIN `pt` ON `peserta`.`pt_id` = `pt`.`id`
---
    public function pesertabyjoinsemua($pt_id = null)
    {
        $builder = $this->db->table('peserta');
        $builder->select('peserta.*, prodi.nama_prodi, pt.nama_pt');
        $builder->join('prodi', 'peserta.prodi_id = prodi.id', 'left');
        $builder->join('pt', 'peserta.pt_id = pt.id', 'left');

        // Apply filter based on pt_id if provided
        if ($pt_id) {
            $builder->where('peserta.pt_id', $pt_id);
        }

        // Print query for debugging (optional)
        // echo $builder->getCompiledSelect();

        $query = $builder->get();