app/Controllers/Auth.php

SELECT `juri`.*, `juri`.`nama_juri` as `username`, `users`.`id` as `user_id`
FROM `users`
JOIN `juri` ON `juri`.`kode_juri` = `users`.`username`
WHERE `username` = 'Adnan Syakir'
---
                    if ($user->status == 0) {
                        return redirect()->to('/loginn')->with('error', 'Akun Anda belum aktif.');
                    } else {
                        $users = $this->db->table('users')->select('juri.*, juri.nama_juri as username, users.id as user_id')
                            ->join('juri', 'juri.kode_juri = users.username')
                            ->where('username', $user->username)
                            ->get()
                            ->getRow();

SELECT `pendamping`.*, `pendamping`.`nama_pendamping` as `username`, `users`.`id` as `user_id`
FROM `users`
JOIN `pendamping` ON `pendamping`.`kode_pendamping` = `users`.`username`
WHERE `username` = 'Riski Hidayat'
---
                    if ($user->status == 0) {
                        return redirect()->to('/loginn')->with('error', 'Akun Anda belum aktif.');
                    } else {
                        $users = $this->db->table('users')->select('pendamping.*, pendamping.nama_pendamping as username, users.id as user_id')
                            ->join('pendamping', 'pendamping.kode_pendamping = users.username')
                            ->where('username', $user->username)
                            ->get()
                            ->getRow();