app/Controllers/Dashboard.php

SELECT *
FROM `pendamping`
SELECT *
FROM `peserta`
---
    public function index(): string
    {
        $pendampingModel = new PendampingModel();
        $pesertaModel = new PesertaModel();
        $cabangLombaModel = new CabangLombaModel();

        $jumlahCabangKompetisi = count($cabangLombaModel->findAll());
        $jumlahPendamping = count($pendampingModel->findAll());
        $jumlahPeserta = count($pesertaModel->findAll());