app/Controllers/KoordinatorProfil.php

SELECT *
FROM `users`
WHERE `users`.`id` = 'fb37eab1-1c4b-4604-9f9f-57f4f0488145'
---
    public function index()
    {
        //   dd(session()->get('data'));

        $userId = $this->session->get('data')->id; // Assuming user_id is stored in session data
        $user = $this->user->find($userId);