app/Controllers/KoordinatorHasillomba.php

SELECT *
FROM `cabang_perlombaan`
---
    public function index()
    {
        $cabangPerlombaanId = $this->request->getGet('cabang_perlombaan_id');

        $data = [
            'hasillomba' => $this->HasilLombaModel->Hasillombabypendaftaran($cabangPerlombaanId),
            'cabang_perlombaan' => $this->cabanglombaModel->findAll(),