app/Controllers/PendampingPendaftaran.php

INSERT INTO `pendaftaran` (`id`, `pt_id`, `cabang_perlombaan_id`, `nama_team`, `peserta_id`, `kode_peserta`, `keterangan`) VALUES ('3b0b0726-2e36-4abd-899f-603ed3d3b46b', '1', '1', 'keren', '9', '22753080', 'anggota 3')
---
            'keterangan' => $this->request->getPost('keterangan'),
        ];

        $this->pendaftaranModel->insert($data);