app/Models/AuthModel.php

SELECT `users`.*, `role`.`role`
FROM `users`
LEFT JOIN `role` ON `role`.`id` = `users`.`role_id`
WHERE `password` = '29e520fe9d18620e1bacd341f8263510f937e09479deebbbeab5ab758a659270'
AND   (
`users`.`email` = 'Adnan Syakir'
OR `users`.`username` = 'Adnan Syakir'
 )
---
    public function checkUser($username, $password)
    {
        // Hash password
        $hashedPassword = hash('sha256', sha1($password));

        // Query ke database untuk mencari user
        $query = $this->select('users.*, role.role')
            ->join('role', 'role.id = users.role_id', 'left')
            ->where('password', $hashedPassword)
            ->groupStart()
            ->where('users.email', $username)
            ->orWhere('users.username', $username)
            ->groupEnd();

        // Jalankan kueri dan ambil hasilnya
        $user = $query->get()->getRow();